Enums/УчетНачисленийВСреднемЗаработкеОтпуск.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Enum>
		<Properties>
			<Name>УчетНачисленийВСреднемЗаработкеОтпуск</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОбщийЗаработок</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПремияМесячная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПремияГодовая</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеВключать</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/УчетНачисленийВСреднемЗаработкеОтпуск/Ext/ManagerModule.bsl
#Область ОбработчикиСобытий

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	ТолькоПремия = Ложь;
	
	СтандартнаяОбработка = Ложь;
	Если Параметры.Свойство("ТолькоПремия") Тогда
		ТолькоПремия = Параметры.ТолькоПремия;
	КонецЕсли;
	
	ДанныеВыбора = Новый СписокЗначений;
	// Добавляем общий заработок, если нет отбора.
	Если Не ТолькоПремия Тогда
		ДанныеВыбора.Добавить(Перечисления.УчетНачисленийВСреднемЗаработкеОтпуск.ОбщийЗаработок);
	КонецЕсли;
	// Заполняем премиями в любом случае.
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(ДанныеВыбора, Премии());
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция Премии() Экспорт
	
	Премии = Новый Массив;
	Премии.Добавить(ПредопределенноеЗначение("Перечисление.УчетНачисленийВСреднемЗаработкеОтпуск.ПремияМесячная"));
	Премии.Добавить(ПредопределенноеЗначение("Перечисление.УчетНачисленийВСреднемЗаработкеОтпуск.ПремияГодовая"));
	
	Возврат Премии;
	
КонецФункции

Функция ГодовыеПремии() Экспорт
	
	Премии = Новый Массив;
	Премии.Добавить(ПредопределенноеЗначение("Перечисление.УчетНачисленийВСреднемЗаработкеОтпуск.ПремияГодовая"));	
	Возврат Премии;
	
КонецФункции

#КонецОбласти
